Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/include/cy_mqtt_api.h
/**
 * Subscribes for MQTT message on the given MQTT topic or list of topics.
 *
 * This API is supported in multi-core environment and can be invoked from the secondary core application.
 *
 * \note
 *       1. Single subscription request with multiple topics, this function returns success if at least one of the subscription is successful.
 *          If subscription fails for any of the topic in the list, the failure is indicated through 'allocated_qos' set to \ref CY_MQTT_QOS_INVALID.
 *          Refer \ref cy_mqtt_subscribe_info_t for more details. Upon return, the 'allocated_qos' indicate the QoS level allocated by the MQTT broker for the successfully subscribed topic.
 *       2. Call \ref cy_mqtt_register_event_callback before calling this API in order to be notified of
 *          data available for the subscribed topic(s).
 * @param mqtt_handle [in]   : MQTT handle created using \ref cy_mqtt_create.
 * @param sub_info [in, out] : Pointer to array of MQTT subscription information structure. Refer \ref cy_mqtt_subscribe_info_t for details.
 * @param sub_count [in]     : Number of subscription topics in the subscription array.
 *
 * @return cy_rslt_t         : CY_RSLT_SUCCESS on success; error codes in @ref mqtt_defines otherwise.
 */
cy_rslt_t cy_mqtt_subscribe( cy_mqtt_t mqtt_handle, cy_mqtt_subscribe_info_t *sub_info, uint8_t sub_count );

/**
 * Registers an event callback for the given MQTT handle.
 *
 * This API is supported in multi-core environment and can be invoked as a virtual API from the secondary core application.
 *
 * @param mqtt_handle [in]    : MQTT handle created using \ref cy_mqtt_create.
 * @param event_callback [in] : Application callback function which needs to be called on arrival of MQTT incoming publish packets and network disconnection notification from network layer.
 * @param user_data [in]      : Pointer to user data to be passed in the event callback.
 *
 * @return cy_rslt_t          : CY_RSLT_SUCCESS on success; error codes in @ref mqtt_defines otherwise.
 */
cy_rslt_t cy_mqtt_register_event_callback( cy_mqtt_t mqtt_handle,
                                           cy_mqtt_callback_t event_callback,
                                           void *user_data );

/**
 * Deregisters an event callback for the given MQTT handle which was previously registered using \ref cy_mqtt_register_event_callback API.
 *
 * This API is supported in multi-core environment and can be invoked as a virtual API from the secondary core application.
 *
 * @param mqtt_handle [in]    : MQTT handle created using \ref cy_mqtt_create.
 * @param event_callback [in] : Callback function which needs to be deregistered.
 *
 * @return cy_rslt_t          : CY_RSLT_SUCCESS on success; error codes in @ref mqtt_defines otherwise.
 */
cy_rslt_t cy_mqtt_deregister_event_callback( cy_mqtt_t mqtt_handle,
                                             cy_mqtt_callback_t event_callback);

/**
 * Unsubscribes from a given MQTT topic.
 *
 * This API is supported in multi-core environment and can be invoked as a virtual API from the secondary core application.
 *
 * @param mqtt_handle [in]   : MQTT handle created using \ref cy_mqtt_create.
 * @param unsub_info [in]    : Pointer to array of MQTT unsubscription information structure. Refer \ref cy_mqtt_unsubscribe_info_t for details.
 * @param unsub_count [in]   : Number of unsubscription topics in the unsubscription array.
 *
 * @return cy_rslt_t         : CY_RSLT_SUCCESS on success; error codes in @ref mqtt_defines otherwise.
 */
cy_rslt_t cy_mqtt_unsubscribe( cy_mqtt_t mqtt_handle, cy_mqtt_unsubscribe_info_t *unsub_info, uint8_t unsub_count );

/**
 * Initiates MQTT client disconnection from connected MQTT broker.
 *
 * @param mqtt_handle [in]   : MQTT handle created using \ref cy_mqtt_create.
 *
 * @return cy_rslt_t         : CY_RSLT_SUCCESS on success; error codes in @ref mqtt_defines otherwise.
 */
cy_rslt_t cy_mqtt_disconnect( cy_mqtt_t mqtt_handle );

/**
 * Deletes the given MQTT instance and frees the resources allocated for the instance by the \ref cy_mqtt_create function.
 * Before calling this API function, MQTT connection with broker must be disconnected. And the MQTT handle should not be used after delete.
 *
 * @param mqtt_handle [in]   : MQTT handle created using \ref cy_mqtt_create.
 *
 * @return cy_rslt_t         : CY_RSLT_SUCCESS on success; error codes in @ref mqtt_defines otherwise.
 */
cy_rslt_t cy_mqtt_delete( cy_mqtt_t mqtt_handle );

/**
 * One-time deinitialization function for network sockets implementation.
 * It should be called after destroying all network socket connections.
 *
 * This API is supported in multi-core environment and can be invoked on the secondary core application
 * to clean up the MQTT virtual-only stack implementation. It should be called when the MQTT virtual
 * APIs are no longer needed.
 *
 * \note \ref cy_mqtt_init and \ref cy_mqtt_deinit API functions are not thread-safe. The caller
 *       must ensure that these two API functions are not invoked simultaneously from different threads.
 *
 * @return cy_rslt_t         : CY_RSLT_SUCCESS on success; error codes in @ref mqtt_defines otherwise.
 */
cy_rslt_t cy_mqtt_deinit( void );

/**
 * @}
 */

#if defined(__cplusplus)
}
#endif

#endif // CY_MQTT_API_H_
